Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/consumer_affairs/consumer_protection/consumer_rights/guarantees.html.txt.tmx
Source language: en
Languages: ga

source: If an item that you have purchased is faulty, you have the right to return the item to the retailer who should be able to repair or replace the item or refund you the cost of the item
ga: Má tá fabht in earra a cheannaigh tú féadfaidh tú an t-earra a thabhairt ar ais don mhiondíoltóir le caoi a chur air nó ceann nua a fháil ina áit nó a luach a fháil ar ais

source: These rights are known as your statutory rights
ga: Tugtar do chearta reachtúla orthu seo

source: A guarantee or warranty on a product gives additional protection and this protection is extended to anyone who has possession of the goods during the lifetime of the guarantee
ga: Bronnann ráthaíocht nó baránta ar tháirge breis cosanta agus tugtar an chosaint seo d’aon duine a bhíonn i seilbh na n-earraí i rith shaolré na ráthaíochta sin

source: A guarantee or warranty is a written statement given by the manufacturer or other company
ga: Séard is banna nó urrús ann ráiteas scríofa ón déantúsóir nó ó aon chomhlacht eile

source: The guarantee or warranty indicates that the manufacturer or other company will repair or replace an item within a set amount of time after it has been purchased
ga: Tugann banna nó urrús le fios go ndeiseoidh an déantúsóir nó an comhlacht eile an t-earra lochtach nó go dtabharfar ceann nua ina áit ar feadh achar áirithe ama tar éis é a cheannach

source: Guarantees are legally binding
ga: Baineann oibligeáid dlí le banna

source: That is, they are enforceable through the courts if necessary
ga: Mar sin is féidir an té nach ndéanann de réir a bhanna a thabhairt chun cúirte

source: The written guarantee should contain the following information:
ga: Ba chóir an t-eolas seo leanas a bheith sa bhanna scríofa:

source: • What goods the guarantee applies to
ga: • na hearraí atá faoi bhanna

source: • The name and address of the person who will honour the guarantee
ga: • ainm agus seoladh an té a bhfuil an banna air

source: • The duration of the guarantee
ga: • fad ama an bhanna

source: • The procedure for making a claim under it (which may not be more difficult than ordinary commercial procedure)
ga: • an chaoi le éileamh a dhéanamh faoi (ba chóir go mbeadh sé chomh héasca céanna le gnáth-bheart gnó)

source: • What action the guarantor undertakes to do and
ga: • na nithe atá geallta ag an té a bhfuil banna air, agus

source: • Whether the purchaser must pay any charges for getting the product repaired (such as postage and packaging)
ga: • aon táille a bheadh le híoc ag an gceannaitheoir le táirge a dheisiú (postas agus pacáistiú, mar shampla)

source: Products such as some household durable goods (pots and pans, furniture etc.) and electrical goods typically come with a guarantee
ga: Go hiondúil bíonn banna le táirgí ar nós earraí fadsaolacha tís (leithéidí gréithe cistine agus baill troscáin) agus earraí leictreacha

source: Some services may also be guaranteed. For example, work undertaken in a house (such as damp-proofing a building) may also be guaranteed for a specific period of time
ga: D'fhéadfadh urrús ar feadh achar áirithe ama a bheith le seirbhísí áirithe cothabhála a dhéanfaí i dteach (taisdhíonadh tí, mar shampla)

source: Guarantees may be used by anyone in possession of goods during the guarantee period
ga: Féadfaidh aon duine ráthaíochtaí a úsáid atá i seilbh earraí i rith thréimhse na ráthaíochta

source: Guarantees can be particularly useful if you receive a gift as you may not need to show proof of purchase to claim the guarantee
ga: Is mór is fiú urrús a bheith le bronntanas a fhaigheann tú mar ní theastaíonn cruthúnas ceannaithe le héileamh a dhéanamh

source: Always check the terms and conditions of the guarantee
ga: Seiceáil téarmaí agus coinníollacha na ráthaíochta i gcónaí

source: Some retailers may offer an extended warranty on larger electrical items, such as a washing machine
ga: D'fhéadfadh sé go dtairgeofaí baránta sínte duit le hearraí móra leictreacha ar nós inneall níocháin

source: An extended warranty covers the item or service after the manufacturer’s guarantee period is over. It is like an insurance policy and it is completely optional
ga: Clúdaíonn baránta sínte an t-earra nó an tseirbhís tar éis dáta deiridh bhanna an déantúsóra.Tá sé ar nós polasaí árachais agus tá sé go hiomlán roghnach

source: Before you pay for an extended warranty, think about what the cost of fixing or replacing the item would normally be
ga: Sula n-íocann tú as baránta sínte, smaoinigh ar an gcostas ba ghnách a bheith ar an earra a dheisiú nó a ionadú

source: Advice on guarantees and warranties
ga: Comhairle faoi urrúis agus barántaí

source: • Read and fully understand the guarantee and warranty
ga: • Déan an ráthaíocht agus an baránta a léamh agus a thuiscint go hiomlán

source: • Make sure the warranty covers problems that you are likely to have
ga: • Cinntigh go gcumhdaíonn an baránta na fadhbanna is dócha a bheidh ort

source: • Do not lose the guarantee or warranty (if you choose to get one)
ga: • Ná caill an ráthaíocht nó an baránta (má roghnaíonn tú chun ceann a fháil)

source: • Remember that you have a guarantee or warranty if the item is faulty
ga: • Ná déan dearmad go bhfuil banna agat má bhíonn fabht san earra

source: • Remember that you still have your consumer rights
ga: • Smaoinigh go bhfuil cearta tomhaltóra agat i gcónaí

source: The Competition and Consumer Protection Commission has information on guarantees and warranties on its website which you may find useful
ga: Tá an Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí eolas ar ráthaíochtaí agus barántas ar a láithreán gréasáin ar féidir leat a bheith úsáideach

source: Guarantees are covered by Sections 15–19 of the Sale of Goods and Supply of Services Act 1980
ga: Tá bannaí clúdaithe ag codanna 15 - 19 den Acht um Dhíol Earraí agus Soláthar Seirbhísí, 1980

source: Any term in a guarantee which makes the retailer or guarantor the sole arbiter of whether the buyer has a claim is void
ga: Coinníoll ar bith i mbanna a deir gurb é an díoltóir nó an té a théann in urrús an t-aon eadránaí amháin i gcás éilimh, tá sé gan éifeacht

source: Generally, retailers and manufacturers do not charge for guarantees
ga: Go hiondúil ní bhaineann díoltóirí ná déantúsóirí táille amach ar bhannaí

source: There may be a charge for an extended warranty but you should not feel obliged to pay for an extended warranty as a guarantee and warranty supplements your consumer rights
ga: D'fhéadfadh sé go mbeadh táille ar bharánta sínte ach ní cóir go gceapfá go bhfuil ort é a íoc os rud é go gcuireann urrús/baránta le do chearta mar thomhaltóir

source: There are different terms and conditions attached to different guarantees
ga: Tá téarmaí agus coinníollacha difriúla ag baint le bannaí éagsúla

source: It is important that you know what these terms are when you buy the product or service and if you go to use a guarantee
ga: Tá sé tábhachtach go dtuigfeá na coinníollacha seo agus tú ag ceannach táirge nó seirbhíse nó má tá tú ag brath an banna a úsáid

source: You can address any queries that you may have on guarantees to the Competition and Consumer Protection Commission
ga: Eolas ar bith atá uait faoi bhannaí is féidir é a iarraidh in an Coimisiún um Iomaíocht agus Cosaint Tomhaltóirí
